xmlsamples/PI_Pricing/KR-FI-BIS-KRR45AMP001B.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns2:esp-fee-inquiry-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGBSKRR450T</id>
            <system>
               <id>WGBSKRR450T</id>
               <name>ICB</name>
               <version>9101</version>
               <ip_address>10.1.40.181</ip_address>
               <connector>
                  <id>KRR45AMP001B</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>BM</id>
            <type>MOBILE</type>
            <cust_entry_device>DIGITALPARTNER</cust_entry_device>
         </device>
         <external_reference_no>20240109175111884827</external_reference_no>
         <transaction_type>WMN</transaction_type>
         <payment_details>
            <origination>
               <principal_amount>74950</principal_amount>
               <currency_iso_code>USD</currency_iso_code>
               <country_iso_code>KR</country_iso_code>
            </origination>
            <destination>
               <currency_iso_code>CNY</currency_iso_code>
               <country_iso_code>CN</country_iso_code>
            </destination>
            <promotion/>
            <taxes/>
            <fees/>
            <payment_type>BankAccount</payment_type>
         </payment_details>
      </ns2:esp-fee-inquiry-request>
   </S:Body>
</S:Envelope>